{
    "heroTitle": "Chekaliuk Dmytro",
    "heroDescription": "Exciting game projects made with Unity. Check them out below!",
    "homeLink": "About me",
    "projectsLink": "Projects",
    "contactLink": "Contacts/Links",
    "buttonText": "Learn More",
    "project1Title": "Space Rog",
    "project1Description": "A simple survival game about saving humanity.",
    "project2Title": "Interpressure",
    "project2Description": "A city-building simulator in an unstable bubble..",

    "project3Title": "Tyman",
    "project4Title": "UkraineGameDev",
    "project5Title": "Doodle Racing",
    "project6Title": "Ads-Slayer",
    "project7Title": "Procedural-generation",

    "project3Description": "A voice assistant with a wide variety of functions for automating processes.",
    "project4Description": "A website about Ukrainian AAA projects.",
    "project5Description": "Racing, where you have to draw a trajectory before the race and see what happens.",
    "project6Description": "Search for the spell, collect the combination, and exterminate all advertising from this world.",
    "project7Description": "A project for testing procedural generation.",
    
    "contactHeading": "Contacts",
    "phoneLabel": "Phone:",
    "emailLabel": "Email:",
    "telegramLabel": "Telegram:",
    "githubLabel": "GitHub",
    "gitlabLabel": "GitLab",
    "aboutMe1": "My name is Dmytro Chekaliuk, and I am a programmer with experience in game, website, and application development. My main specialization is Unity development and programming in C#, and I also work with Python, HTML, CSS, and JavaScript.",
    "aboutMe2": "I started programming in Unity in June 2022, and since then, I have created several interesting games. In October 2023, I also began working with Python, and in September 2024, I started programming websites and applications using HTML, CSS, and JavaScript. This allows me to work on both game projects and web development, which broadens my skills and opportunities.",
    "aboutMe3": "Currently, I am studying for a Bachelor's degree in Software Engineering at Vinnytsia National Technical University. My goal is to become a highly skilled programmer and game development specialist while continuously improving my abilities in creating multiplayer games in Unity.",
    "aboutMe4": "One of the most exciting moments in my career was participating in a Game Jam at the beginning of 2025. I joined a team of 10 people and became the team leader. My role involved managing the game's development, being the lead programmer, and also serving as a Game Designer and consultant for other team members on coding solutions.",
    "aboutMe5": "Programming gives me great satisfaction. I aim to create not only technical solutions but also mechanics that are interesting and emotionally enriching. It is important for me that the code is not only effective but also clear, engaging, and enjoyable for users.",
    "aboutMe6": "Besides programming, my hobbies include gaming, playing the guitar, walking, composing songs, and reading books.",
    
    "g1text":"For many years, humanity has been sending signals into space, hoping to find other life forms. And he succeeded, but unfortunately, the aliens were not in the mood for friendly relations. Take the role of the first pilot of Space Rog and help the planet not to die out.",
    "g2text":"Humanity nearly destroyed the Earth's atmosphere through greenhouse gas emissions, prompting the decision to leave the planet. However, constructing interstellar spaceships proved to be unacceptably expensive. As a result, a new and cost-effective technology called the 'bubble' was invented. You are part of the first group testing this innovative technology. Your task is to create the ideal city for living while managing the bubble's deformation to ensure it remains intact.",
    

    "teg1": "Character Progression",
    "teg2": "Difficulty Levels",
    "teg3": "Daily Quests",
    "teg4": "Quests",
    "teg5": "Progress",
    "teg6": "Varied Enemies",
    "teg7": "Advertising",
    "teg8": "Endless Mode",
    "teg9": "Bubble Deformation",
"teg10": "Construction",
"teg11": "Economy",
"teg12": "Storyline",
"teg13": "Tutorial"



}
  