{
    "heroTitle": "Мої проєкти",
    "heroDescription": "Захоплюючі ігрові проєкти, створені на Unity. Переглянь їх нижче!",
    "homeLink": "Про мене",
    "projectsLink": "Проєкти",
    "contactLink": "Контакти/Посилання",
    "buttonText": "Дізнатися більше",
    "project1Title": "SpaceRog",
    "project1Description": "Проста гра про виживання і рятування людства.",
    "project2Title": "Interpressure",
    "project2Description": "Симклятор городо-будівництва в нестабільній бульбашці.",
    
    "project3Title": "Tyman",
    "project4Title": "UkraineGameDev",
    "project5Title": "Doodle Racing",
    "project6Title": "Ads-Slayer",
    "project7Title": "Procedural-generation",

    "project3Description": "Голосовий помічник з великим різноманіттям функції, для автоматизації процесів.",
    "project4Description": "Сайт про українські ААА проєкти.",
    "project5Description": "Гонки, де тобі потрібно намалювати траєкторію руху перед заїздом і дивитися що вийде.",
    "project6Description": "Шукай закляття, збирай комбінацію і винижи всю рекламу з цього світу.",
    "project7Description": "Проект для тестування процедурної генерації.",

    "contactHeading": "Контакти",
    "phoneLabel": "Телефон:",
    "emailLabel": "Email:",
    "telegramLabel": "Telegram:",
    "githubLabel": "GitHub",
    "gitlabLabel": "GitLab",
    "aboutMe1": "Мене звати Дмитро Чекалюк, я програміст з досвідом роботи в розробці ігор, сайтів та додатків. Моя основна спеціалізація — розробка на Unity та програмування на C#, а також я працюю з Python, HTML, CSS і JavaScript.",
    "aboutMe2": "Я почав програмувати на Unity в червні 2022 року, і з того часу створив кілька цікавих ігор. З жовтня 2023 року я також працюю з Python, а з вересня 2024 року почав програмувати сайти та додатки на HTML, CSS та JavaScript. Це дає мені можливість працювати як над ігровими проєктами, так і над веб-розробкою, що розширює мої можливості та навички.",
    "aboutMe3": "Наразі я навчаюся на бакалавра за спеціальністю Інженерія програмного забезпечення у Вінницькому Національному Технічному Університеті. Моя мета — стати висококваліфікованим програмістом і спеціалістом з розробки ігор, при цьому постійно покращуючи свої навички у створенні мультиплеєрних ігор на Unity.",
    "aboutMe4": "Одним з найбільш цікавих моментів у моїй кар'єрі було моє участь у Game Jam на початку 2025 року. Я вступив у команду з 10 осіб і став її лідером. Моя роль полягала в управлінні розробкою гри, я був основним програмістом, а також Game Designer і консультантом по кодуванню для інших учасників команди.",
    "aboutMe5": "Програмування приносить мені велике задоволення. Я прагну створювати не тільки технічні рішення, а й механіки, що є цікавими і емоційно збагачують. Мені важливо, щоб код був не тільки ефективним, але й зрозумілим, цікавим і приносив радість користувачам.",
    "aboutMe6": "Окрім програмування, мої захоплення включають ігри, гру на гітарі, прогулянки, складання пісень і читання книг."
}
  